Revit 2027 API
BuiltInFailures.DecalFailures.OutsideHost Property
 Decal does not lie on host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId OutsideHost { get; }
Public Shared ReadOnly Property OutsideHost As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ OutsideHost {
	FailureDefinitionId^ get ();
}
static member OutsideHost : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DecalFailures Class
Autodesk.Revit.DB Namespace